In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df1=pd.read_csv(r"C:\Users\HP\Desktop\Data Science\houseprice.csv")
df1.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df1["area_type"].value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [5]:
df1.corr()

             bath   balcony     price
bath     1.000000  0.204201  0.456345
balcony  0.204201  1.000000  0.120355
price    0.456345  0.120355  1.000000

# dropping the coloumns

In [7]:
df2=df1.drop(["area_type","society","balcony","availability"],axis="columns")
df2.shape

(13320, 5)

In [8]:
df2.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [9]:
df2.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [10]:
df3=df2.dropna()
df3.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [12]:
df3["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [13]:
df3['bhk']= df3["size"].apply(lambda x: int(x.split(" ")[0]))

C:\Users\HP\anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [14]:
df3.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [15]:
df3.dtypes

location       object
size           object
total_sqft     object
bath          float64
price         float64
bhk             int64
dtype: object

In [31]:
df3["bhk"].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18], dtype=int64)

In [32]:
df3[df3["bhk"]>20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [33]:
df3["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [34]:
def is_float(x):
    try:
        float(x)
        return True
    except:
        return False

###

In [35]:
df3[~df3["total_sqft"].apply(is_float)]

                 location   size   total_sqft  bath    price  bhk
30              Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122                Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165              Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188              KR Puram  2 BHK  1015 - 1540   2.0   56.800    2
...                   ...    ...          ...   ...      ...  ...
12975          Whitefield  2 BHK   850 - 1060   2.0   38.190    2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  122.000    3
13059              Harlur  2 BHK  1200 - 1470   2.0   72.760    2
13265               Hoodi  2 BHK  1133 - 1384   2.0   59.135    2
13299          Whitefield  4 BHK  2830 - 2882   5.0  154.500    4

[190 rows x 6 columns]

In [36]:
def convert_sqft_to_num(x):
    tokens = x.split("-")
    if len(tokens) ==2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
               return float(x)
    except:
               return None

In [37]:
convert_sqft_to_num("2650")

2650.0

In [38]:
convert_sqft_to_num("2100-2875")

2487.5

####

In [39]:
df4 = df3.copy()
df4.head()

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2

In [40]:
df4["total_sqft"]=df4["total_sqft"].apply(convert_sqft_to_num)
df4.head()

                   location       size  total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2               Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3        Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                  Kothanur      2 BHK      1200.0   2.0   51.00    2

In [41]:
df4.corr()

            total_sqft      bath     price       bhk
total_sqft    1.000000  0.392743  0.574330  0.346013
bath          0.392743  1.000000  0.456350  0.898408
price         0.574330  0.456350  1.000000  0.397222
bhk           0.346013  0.898408  0.397222  1.000000

In [42]:
df4.loc[30]

location      Yelahanka
size              4 BHK
total_sqft         2475
bath                  4
price               186
bhk                   4
Name: 30, dtype: object

In [43]:
df5=df4.copy()
df5["price_per_sqft"]=df5["price"]*100000/df5["total_sqft"]
df5.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000

In [44]:
df5.corr()

                total_sqft      bath     price       bhk  price_per_sqft
total_sqft        1.000000  0.392743  0.574330  0.346013       -0.008267
bath              0.392743  1.000000  0.456350  0.898408        0.030883
price             0.574330  0.456350  1.000000  0.397222        0.028387
bhk               0.346013  0.898408  0.397222  1.000000        0.030955
price_per_sqft   -0.008267  0.030883  0.028387  0.030955        1.000000

# we will reduce dimensionality curse

In [45]:
len(df5["location"].unique())

1304

In [46]:
df5["location"].apply(lambda x: x.strip())

0        Electronic City Phase II
1                Chikka Tirupathi
2                     Uttarahalli
3              Lingadheeranahalli
4                        Kothanur
                   ...
13315                  Whitefield
13316               Richards Town
13317       Raja Rajeshwari Nagar
13318             Padmanabhanagar
13319                Doddathoguru
Name: location, Length: 13246, dtype: object

In [47]:
location_stats=df5.groupby("location")["location"].agg('count').sort_values(ascending=False)

In [48]:
location_stats

location
Whitefield                            534
Sarjapur  Road                        392
Electronic City                       302
Kanakpura Road                        266
Thanisandra                           233
                                     ...
Konappana Agrahara                      1
Kodanda Reddy Layout                    1
Kirloskar layout, Basaveshwarnagar      1
Kengeri Satellite Town Stage II         1
 Anekal                                 1
Name: location, Length: 1304, dtype: int64

In [1]:
location_stats=df5["location"].value_counts()

NameError: name 'df5' is not defined

In [50]:
location_stats

Whitefield                 534
Sarjapur  Road             392
Electronic City            302
Kanakpura Road             266
Thanisandra                233
                          ...
Konappana Agrahara           1
Yelahanka,MVIT college       1
Banashankari 2 nd Stage      1
Halanayakanahalli            1
Shirdi Sai Nagar             1
Name: location, Length: 1304, dtype: int64

In [51]:
len(location_stats[location_stats<=10])

1063

In [52]:
(df5["location"].value_counts()<=10).sum()

1063

In [53]:
location_stats_less_than_10=location_stats[location_stats<=10]

In [54]:
location_stats_less_than_10

Basapura                   10
1st Block Koramangala      10
Sadashiva Nagar            10
Kalkere                    10
Naganathapura              10
                           ..
Konappana Agrahara          1
Yelahanka,MVIT college      1
Banashankari 2 nd Stage     1
Halanayakanahalli           1
Shirdi Sai Nagar            1
Name: location, Length: 1063, dtype: int64

In [55]:
len(df5.location.unique())

1304

In [56]:
len(df5["location"].unique())

1304

In [57]:
df5["location"]=df5["location"].apply(lambda x: 'other' if x in location_stats_less_than_10 else x)

In [58]:
len(df5["location"].unique())

242

In [59]:
df5.head(10)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
5,Whitefield,2 BHK,1170.0,2.0,38.00,2,3247.863248
6,Old Airport Road,4 BHK,2732.0,4.0,204.00,4,7467.057101
7,Rajaji Nagar,4 BHK,3300.0,4.0,600.00,4,18181.818182
8,Marathahalli,3 BHK,1310.0,3.0,63.25,3,4828.244275
9,other,6 Bedroom,1020.0,6.0,370.00,6,36274.509804

#now we will do outlier removal

In [60]:
df5[df5["total_sqft"]/df5["bhk"]<300].head()

         location       size  total_sqft  bath  price  bhk  price_per_sqft
9           other  6 Bedroom      1020.0   6.0  370.0    6    36274.509804
45     HSR Layout  8 Bedroom       600.0   9.0  200.0    8    33333.333333
58  Murugeshpalya  6 Bedroom      1407.0   4.0  150.0    6    10660.980810
68          other  8 Bedroom      1350.0   7.0   85.0    8     6296.296296
70          other  3 Bedroom       500.0   3.0  100.0    3    20000.000000

In [61]:
df5.shape

(13246, 7)

In [62]:
df6=df5[~(df5["total_sqft"]/df5["bhk"]<300)]

In [63]:
df6.shape

(12502, 7)

In [64]:
df6['price_per_sqft'].describe()

count     12456.000000
mean       6308.502826
std        4168.127339
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

we will make a grouping them by location first and on basis of that per location i get this subdf for which i am calculating mean and std dev and then filter out all those data pts which are beyond m+st and m-st(68% area in statistics) that i will keep in my reduced_df and keep on appending those dataframes per location and this will give me output data frame

In [65]:
def remove_pps_outliers(df):
    df_out=pd.DataFrame()
    for key,subdf in df.groupby('location'):
        m=np.mean(subdf.price_per_sqft)
        st=np.std(subdf.price_per_sqft)
        reduced_df=subdf[(subdf.price_per_sqft>(m-st))&(subdf.price_per_sqft<(m+st))]
        df_out=pd.concat([df_out,reduced_df],ignore_index=True)
    return df_out

In [66]:
remove_pps_outliers(df6)

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Devarachikkanahalli,3 BHK,1250.0,2.0,44.00,3,3520.000000
1,Devarachikkanahalli,2 BHK,1250.0,2.0,40.00,2,3200.000000
2,Devarachikkanahalli,2 Bedroom,1200.0,2.0,83.00,2,6916.666667
3,Devarachikkanahalli,2 BHK,1170.0,2.0,40.00,2,3418.803419
4,Devarachikkanahalli,3 BHK,1425.0,2.0,65.00,3,4561.403509
...,...,...,...,...,...,...,...
10239,other,2 BHK,1353.0,2.0,110.00,2,8130.081301
10240,other,1 Bedroom,812.0,1.0,26.00,1,3201.970443
10241,other,3 BHK,1440.0,2.0,63.93,3,4439.583333
10242,other,2 BHK,1075.0,2.0,48.00,2,4465.116279
10243,other,4 BHK,3600.0,5.0,400.00,4,11111.111111

In [67]:
df7=remove_pps_outliers(df6)

In [68]:
df7.shape

(10244, 7)

In [69]:
df7.head()

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Devarachikkanahalli,3 BHK,1250.0,2.0,44.0,3,3520.000000
1,Devarachikkanahalli,2 BHK,1250.0,2.0,40.0,2,3200.000000
2,Devarachikkanahalli,2 Bedroom,1200.0,2.0,83.0,2,6916.666667
3,Devarachikkanahalli,2 BHK,1170.0,2.0,40.0,2,3418.803419
4,Devarachikkanahalli,3 BHK,1425.0,2.0,65.0,3,4561.403509

In [70]:
df7[df7['bath']>df7['bhk']+2]

           location       size  total_sqft  bath   price  bhk  price_per_sqft
1637  Chikkabanavar  4 Bedroom      2460.0   7.0    80.0    4     3252.032520
5232     Nagasandra  4 Bedroom      7000.0   8.0   450.0    4     6428.571429
6702    Thanisandra      3 BHK      1806.0   6.0   116.0    3     6423.034330
8405          other      6 BHK     11338.0   9.0  1000.0    6     8819.897689

In [71]:
df8=df7[df7['bath']<df7['bhk']+2]

In [72]:
df8.shape

(10150, 7)

In [73]:
df9=df8.drop(["size","price_per_sqft"], axis=1)

In [74]:
df9.head()

               location  total_sqft  bath  price  bhk
0   Devarachikkanahalli      1250.0   2.0   44.0    3
1   Devarachikkanahalli      1250.0   2.0   40.0    2
2   Devarachikkanahalli      1200.0   2.0   83.0    2
3   Devarachikkanahalli      1170.0   2.0   40.0    2
4   Devarachikkanahalli      1425.0   2.0   65.0    3

In [78]:
df10=pd.get_dummies(df9)

In [79]:
df10.shape

(10150, 246)

In [80]:
df10.dtypes

total_sqft                       float64
bath                             float64
price                            float64
bhk                                int64
location_ Devarachikkanahalli      uint8
                                  ...
location_Yelahanka                 uint8
location_Yelahanka New Town        uint8
location_Yelenahalli               uint8
location_Yeshwanthpur              uint8
location_other                     uint8
Length: 246, dtype: object

In [83]:
df10.head()

,total_sqft,bath,price,bhk,location_ Devarachikkanahalli,location_1st Block Jayanagar,location_1st Phase JP Nagar,location_2nd Phase Judicial Layout,location_2nd Stage Nagarbhavi,location_5th Block Hbr Layout,...,location_Vijayanagar,location_Vishveshwarya Layout,location_Vishwapriya Layout,location_Vittasandra,location_Whitefield,location_Yelachenahalli,location_Yelahanka,location_Yelahanka New Town,location_Yelenahalli,location_Yeshwanthpur
0,1250.0,2.0,44.0,3,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1250.0,2.0,40.0,2,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1200.0,2.0,83.0,2,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1170.0,2.0,40.0,2,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1425.0,2.0,65.0,3,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

#dummies=pd.get_dummies(df9)
df10=pd.concat([df9,dummies],axis="columns") in this way also you can create dummies

In [85]:
x=df10.drop(["price"],axis="columns")

In [86]:
x.head()

,total_sqft,bath,bhk,location_ Devarachikkanahalli,location_1st Block Jayanagar,location_1st Phase JP Nagar,location_2nd Phase Judicial Layout,location_2nd Stage Nagarbhavi,location_5th Block Hbr Layout,location_5th Phase JP Nagar,...,location_Vijayanagar,location_Vishveshwarya Layout,location_Vishwapriya Layout,location_Vittasandra,location_Whitefield,location_Yelachenahalli,location_Yelahanka,location_Yelahanka New Town,location_Yelenahalli,location_Yeshwanthpur
0,1250.0,2.0,3,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1250.0,2.0,2,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1200.0,2.0,2,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1170.0,2.0,2,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1425.0,2.0,3,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [87]:
y=df10["price"]

In [89]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=10)

In [90]:
from sklearn.linear_model import LinearRegression

In [92]:
lrg=LinearRegression()

In [93]:
lrg.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [96]:
pred=lrg.predict(x_test)

In [97]:
pred

array([93.65837278, 42.17534562, 62.02773468, ..., 32.21216524,
       78.48425747, 58.02457691])

In [94]:
lrg.score(x_test,y_test)

0.7696010329660946

# cross fold k validation technique

In [95]:
from sklearn.model_selection import ShuffleSplit
from sklearn.model_selection import cross_val_score

cv=ShuffleSplit(n_splits=5,test_size=0.2,random_state=0)
cross_val_score(LinearRegression(),x,y,cv=cv)

array([0.78095237, 0.78604188, 0.78301444, 0.85442122, 0.77681843])